[
  {
    "title": "Say Goodbye to Annoying Ads",
    "date": "13th June 2023",
    "content": "<p>Discover how to block nearly all ads on your Android or iOS device for free without needing to download any additional apps.</p><h1>Working of AdGuard DNS</h1><p>AdGuard DNS is a service that works by filtering out unwanted and malicious content from your internet traffic before it reaches your device. It does this by redirecting your DNS requests to their own servers, where they are analyzed and filtered.</p><p> AdGuard DNS blocks ads, trackers, phishing websites, and malicious domains, which helps to protect your privacy and security while browsing the internet. Essentially, it acts as a protective shield between your device and the internet, ensuring that you only receive safe and relevant content.</p><img src=\"https://scontent-del1-2.xx.fbcdn.net/v/t39.30808-6/340077454_264959099202993_9145770072586135780_n.png?_nc_cat=103&ccb=1-7&_nc_sid=e3f864&_nc_ohc=FWJSZcnbbtsAX_bJu6A&_nc_ht=scontent-del1-2.xx&oh=00_AfBgi8LE25QTPHa_qsD8uN4elWaLDZfcrBEIRq-1EEtGWA&oe=648D3B2E\"><h1>The Solution (free)</h1><h2>Adding Custom DNS to an Android Device</h2><p>1. Open Settings on your Android device.<br>2. Tap on Wi-Fi or Network & Internet depending on your device.<br>3. Find and tap on the network you want to modify.<br>4. Tap on the gear icon next to the network name.<br>5. Scroll down and select Advanced options.<br>6. Look for the DNS option and tap on it.<br>7. Enter the IP address of the DNS server you want to use.<br>8. Tap the Save button to apply the changes.</p><h2>Adding Custom DNS to an iPhone</h2><p>1. Open the Settings app on your iPhone.<br>2. Tap on Wi-Fi.<br>3. Find and tap on the network you want to modify.<br>4. Tap on the i icon next to the network name.<br>5. Scroll down and look for the DNS option.<br>6. Tap on Configure DNS and select Manual.<br>7. Tap on Add Server and enter the IP address of the DNS server you want to use.<br>8. Tap Save to save the changes.</p><img src=\"https://lh3.googleusercontent.com/vlEHlnRwrJ713eMPXbn1LbH7iAc7vWGXdhWJQZJQLWk8yOt12AvU6aHOeG69kk7csHtZV3DedMp3U8C6VC_CjLM-ug=w640-h400-e365-rj-sc0x00ffffff\"><h5>You can also download adguard from your app store ! (paid)</h5><h1>Adguard on a laptop/PC</h1><p> Just add Adguard browser extension to your browser.</p><br><h5>Note: This will not block ads from apps like youtube and google playstore</h5><p>Reason : the ads are hardcoded into the application.</p>",
    "image": ""
  },
  {
    "title": "My Second Blog Post",
    "date": "2022-02-01",
    "content": "<p>Welcome to my second blog post!</p><p>Integer vel rutrum mi. Nulla facilisi. Fusce vitae justo sit amet ante dapibus vulputate sed eget nibh. Suspendisse potenti. Nunc feugiat faucibus turpis.</p>",
    "image": ""
  }
]
