[
    {
        "title": "Say Goodbye to Annoying Ads",
        "date": "13th June 2023",
        "content": "<p>Discover how to block nearly all ads on your Android or iOS device for free without needing to download any additional apps.</p><h1>Working of AdGuard DNS</h1><p>AdGuard DNS is a service that works by filtering out unwanted and malicious content from your internet traffic before it reaches your device. It does this by redirecting your DNS requests to their own servers, where they are analyzed and filtered.</p><p> AdGuard DNS blocks ads, trackers, phishing websites, and malicious domains, which helps to protect your privacy and security while browsing the internet. Essentially, it acts as a protective shield between your device and the internet, ensuring that you only receive safe and relevant content.</p><h1>The Solution (free)</h1><h2>Adding Custom DNS to an Android Device</h2><p>1. Open Settings on your Android device.<br>2. Tap on Wi-Fi or Network & Internet depending on your device.<br>3. Find and tap on the network you want to modify.<br>4. Tap on the gear icon next to the network name.<br>5. Scroll down and select Advanced options.<br>6. Look for the DNS option and tap on it.<br>7. Enter the IP address of the DNS server you want to use.<br>8. Tap the Save button to apply the changes.</p><h2>Adding Custom DNS to an iPhone</h2><p>1. Open the Settings app on your iPhone.<br>2. Tap on Wi-Fi.<br>3. Find and tap on the network you want to modify.<br>4. Tap on the i icon next to the network name.<br>5. Scroll down and look for the DNS option.<br>6. Tap on Configure DNS and select Manual.<br>7. Tap on Add Server and enter the IP address of the DNS server you want to use.<br>8. Tap Save to save the changes.</p><img src=\"https://lh3.googleusercontent.com/vlEHlnRwrJ713eMPXbn1LbH7iAc7vWGXdhWJQZJQLWk8yOt12AvU6aHOeG69kk7csHtZV3DedMp3U8C6VC_CjLM-ug=w640-h400-e365-rj-sc0x00ffffff\"><h5>You can also download adguard from your app store ! (paid)</h5><h1>Adguard on a laptop/PC</h1><p> Just add Adguard browser extension to your browser.</p><br><h5>Note: This will not block ads from apps like youtube and google playstore</h5><p>Reason : the ads are hardcoded into the application.</p>",
        "image": ""
  },
    {
        "title": "Must Have Color Pickers for Designers",
        "date": "15th June 2023",
        "content": "<p>Unleash your creativity with our diverse range of color palettes and user-friendly color pickers, and embrace the endless possibilities of the color spectrum.</p><br><p>As a web designer or graphic artist, you come across numerous colors on the web or images that you may want to use in your designs. To save you the hassle of memorizing color values, an eyedropper tool or color picker is a must-have. Here are more than 20 of them, with convenient features for both PC and mobile phone.</p><br><h1>Realtime Colors (Recommended  + Best)</h1><p>RealTimeColors is a web application that allows users to generate dynamic and eye-catching color palettes in real-time. With a simple and intuitive interface, users can explore various color combinations and adjust color values to create the perfect palette for their design needs.<br>RealTimeColors also provides useful features such as saving and sharing palettes, and integrating with popular design tools like Figma and Sketch. Whether you're a designer, developer, or anyone looking for beautiful color schemes, RealTimeColors is a powerful tool that makes creating and experimenting with colors easy and fun. It also allows you to use custom fonts for testing with the colors.</p><br><h1>Desktop Apps</h1><h3>Colorpicker 5 (Free)</h3><p>A minimal desktop app, Colorpicker comes with a simple interface. It comes with a picker that allows you to grab any color on your screen and check its Hexadecimal or RGB code. You can also save your colors in a color book. Plus, there’s a tinting tool that helps you find the best tint.</p><p>Download for:</p><p><a href=\"https://github.com/Toinane/colorpicker/releases/tag/2.2.0\">Windows</a></p><h3>Just Color Picker 1 (Free)</h3><p>Just Color Picker is not just your average color picker. It displays colors in HTML, RGB, HEX, HSB/HSV, and HSL formats. It has a magnifier with three different settings, RGB and RYB color wheel to display triads and complementary colors, a color finder for harmonious matching, color code conversions, and much more!</p><p>Download for:</p><p><a href=\"https://annystudio.com/software/colorpicker/#download\">WindowsMac</a></p><h3>Digital Color Meter (Native Mac)</h3><p>Digital Color Meter is a macOS app that lets you find the value or code of any color by moving an aperture over any part of your screen. You will see the colors in a Digital Color Meter window. You can also increase or decrease the size of the aperture, lock its position, and change the format of the displayed color value.</p><p>Download For:</p><p><a href=\"https://support.apple.com/en-hk/guide/digital-color-meter/welcome/mac\">Mac</a></p><h3>ColorSlurp 2 (Free)</h3><p>Available as both an iOS and macOS app, ColorSlurp features a high-precision magnifier to get the color code information of any color on your screen. It enables you to organize palettes, check color contrast for accessibility, choose colors will your camera, and sync with iCloud.</p><p>Download for:</p><p><a href=\"https://apps.apple.com/us/app/colorslurp/id1287239339?ls=1&mt=12\">Mac</a></p><h3>Color Peeker 1 (Free)</h3><p>A real-time digital color meter, Color Peeker that tells you the hex code of any color under your mouse pointer. The macOS app creates an icon in your menu bar so you can easily use it at any time. Plus, a simple right-click lets you copy the color code and you can use it anywhere.</p><p>Download for:</p><p><a href=\"https://apps.apple.com/us/app/color-peeker/id1592573138?mt=12\">Mac</a></p><h3>System Color Picker 1 (Free)</h3><p>System Color Picker sits quietly in your menu bar and gets up to work as you toggle it on. Through a small color sampler window, you can pick any color and check its information. You can copy the colors as Hex codes, RGB, HSL, or LCH.</p><p>Download for:</p><p><a href=\"https://apps.apple.com/app/id1545870783\">Mac</a></p><h3>Pikka Color Picker 1 (Free)</h3><p>Pikka is a color picker and palette-generator tool that works perfectly with multiple screens. Just pick any color through the pointer and simply copy its value to the clipboard. Moreover, you can organize colors, upload selected colors on iCloud, create color schemes, create color shades and tints, and export colors as .ase or .clr files.</p><p>Download for:</p><p><a href=\"https://apps.apple.com/us/app/pikka-color-picker/id1195076754?mt=12\">Mac</a></p><h3>RCWebColorPicker (Free)</h3><p>RCWebColorPicker is a very simple tool that displays RGB value in HTML-friendly HEX value. You can limit the slider to show only web-safe colors if you prefer. This tool should show up in the color panel of most Cocoa and Carbon apps.</p><p>Download for:</p><p><a href=\"https://rubicode.com/Software/Bundles.html#RCWebColorPicker\">Mac</a></p><h3>Instant Eyedropper (Free)</h3><p>Instant Eyedropper is a free tool that helps you find the HTML color codes of any pixel on your screen. With just a single click, the code will be copied to the clipboard, then you can paste it wherever needed.</p><p>Download for:</p><p><a href=\"http://instant-eyedropper.com\">Windows</a></p><h3>GetColor! (Free)</h3><p>GetColor! is a very simple color picker that displays colors in RGB, HEX, HTML, and WinAPI formats. You can then copy one or all of them to the clipboard. It can also be minimized to the system tray.</p><p>Download for:</p><p><a href=\"https://www.wincatalog.com/getcolor-download.html\">Windows</a></p><h3>Color Cop (Free)</h3><p>Color Cop may be small, but it has a lot of great features. You can use the eyedropper to grab colors from anywhere on the screen and even use the magnifying glass to zoom in for a closer view. Colors can be displayed in HTML hex, Delphi hex, Powerbuilder, Visual Basic, Clarion, Visual C++, RGB float, and RGB int formats, which will be automatically copied to the clipboard. You can save up to 7 colors in the history, find complementary and web-safe colors, minimize the app to the system tray, and more.</p><p>Download for:</p><p><a href=\"http://colorcop.net/download/\">Windows</a></p><h3>ColorMania 1 (Free)</h3><p>ColorMania lets you pick colors from anywhere on your screen. There is also a built-in magnifier for greater accuracy. Colors can be displayed in RGB, HSV, HSL, and CMYK values. You can also save up to 6 colors in the palette.</p><p>Download for:</p><p><a href=\"https://www.blacksunsoftware.com/colormania.html\">Windows</a></p><h1>Mobile App</h1><h3>Pixolor (Free)</h3><p>Pixolor is a live color picker Andorra app. It gives you a circle floating over your Android screen and shows you a zoomed view at pixel level and the color information of each pixel. You can copy the color code and use it in your image editing tool. It also shows you the coordinates of the central pixel.</p><p>Avalable for: ios & android</p><h1>For Browsers</h1><h3>Color by Fardos (Free)</h3><p>An intuitive color picker Chrome extension, Color by Fardos lets you pick and save colors from any site on the browser. You can also customize colors, save multiple colors and liner and circular gradients, adjust the keyboard shortcuts to your liking, find complementary shades and tints for any color, and much more.</p><p>Avalable for: Chrome & Firefox</p><h3>Live color picker (Free)</h3><p>Live Color Picker is a Chrome extension to select any color from any website and save it right through your browser tab. It lets you copy colors in different formats like HEX, RGB, and HSV. You can also adjust colors using the RGB ring and use it in your image editing tool.</p><p>Avalable for: Chrome</p><h3>Color Picker for Chrome (Free)</h3><p>Color Picker for Chrome is an advanced eyedropper tool to find the information on any color in your browser. With the tool, you can copy colors in the HEX and RGB codes and use the copied codes anywhere. There’s a color picker palette pop-up to choose any color that you want, plus you can see a history of all colors picked.</p><p>Avalable for: Chrome</p><h3>PixelZoomer (Free)</h3><p>PixelZoomer is great for grabbing colors and displaying them as HEX code. It works slightly differently from the norm because it renders web pages as screenshots and zooms in using a new CSS attribute. This is done so that the pixels are rendered crisp without using anti-aliasing.</p><p>Avalable for: Chrome & Firefox</p><h3>ColorZilla (Free)</h3><p>ColorZilla is just like your basic color picker, and eyedropper tool, except it lives in your browser. It’s an addon for Firefox that lets you grab the color of any pixel inside your browser. The built-in palette browser allows you to choose colors from pre-defined color sets and save the most used colors in custom palettes.</p><p>Avalable for: Chrome & Firefox</p><h3>Eye Dropper (Free)</h3><p>Eye Dropper is a great extension with an advanced color picker that lets you see the HSV, RGB, and HEX color values of the grabbed color. Colors are stored in your history for later reference, and it can also be copied to the clipboard.</p><p>Avalable for: Chrome</p><h3>Color Pick (Free)</h3><p>Color Pick is a very simple eyedropper with an attached magnifier. Once you’ve picked your desired color, the extension will save it for you until you pick a new one. Colors are displayed in RGB, HSL, and HEX formats.</p><p>Avalable for: Chrome & Firefox</p><p>Enjoy!</p><br>",
        "image": ""
  }
]
